CSI API ETABS v1

# cDesignCompositeBeamSetDesignSection Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetDesignSection(
    	string Name,
    	string PropName,
    	bool LastAnalysis,
    	eItemType ItemType = eItemType.Objects
    )

    Function SetDesignSection (
    	Name As String,
    	PropName As String,
    	LastAnalysis As Boolean,
    	Optional ItemType As eItemType = eItemType.Objects
    ) As Integer

    Dim instance As cDesignCompositeBeam
    Dim Name As String
    Dim PropName As String
    Dim LastAnalysis As Boolean
    Dim ItemType As eItemType
    Dim returnValue As Integer

    returnValue = instance.SetDesignSection(Name,
    	PropName, LastAnalysis, ItemType)

    int SetDesignSection(
    	String^ Name,
    	String^ PropName,
    	bool LastAnalysis,
    	eItemType ItemType = eItemType::Objects
    )

    abstract SetDesignSection :
            Name : string *
            PropName : string *
            LastAnalysis : bool *
            ?ItemType : eItemType
    (* Defaults:
            let _ItemType = defaultArg ItemType eItemType.Objects
    *)
    -> int

#### Parameters

Name

    Type: SystemString

PropName

    Type: SystemString

LastAnalysis

    Type: SystemBoolean

ItemType (Optional)

    Type: ETABSv1eItemType

#### Return Value

Type: Int32

See Also

#### Reference

cDesignCompositeBeam Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com